/*
 Navicat Premium Data Transfer

 Source Server         : student
 Source Server Type    : MySQL
 Source Server Version : 80030
 Source Host           : localhost:3306
 Source Schema         : stu

 Target Server Type    : MySQL
 Target Server Version : 80030
 File Encoding         : 65001

 Date: 12/06/2024 17:15:02
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for stud
-- ----------------------------
DROP TABLE IF EXISTS `stud`;
CREATE TABLE `stud`  (
  `sno` int NULL DEFAULT NULL,
  `name` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `sex` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `age` int NULL DEFAULT NULL,
  `medical` varchar(80) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of stud
-- ----------------------------
INSERT INTO `stud` VALUES (1, '张三', '男', 18, '既往体健，否认高血压病、糖尿病、冠心病等慢性疾病，否认肝炎、结核、伤寒、疟疾等传染疾病，否认重大外伤史，输血史及手术史，否认食物与药物过敏史。预防接种史不详');
INSERT INTO `stud` VALUES (2, '李四', '男', 18, '十岁曾患肺结核，系统治疗一年半，现已痊愈');
INSERT INTO `stud` VALUES (3, '王五', '男', 20, '既往体健，否认高血压病、糖尿病、冠心病等慢性疾病，否认肝炎、结核、伤寒、疟疾等传染疾病，否认重大外伤史，输血史及手术史，否认食物与药物过敏史。预防接种史不详');
INSERT INTO `stud` VALUES (4, '赵启', '女', 19, '患有先天性心脏病室间隔缺损，缺损0.3cm，曾在市中心医院就诊，有医院诊断证明，现生长发育良好');
INSERT INTO `stud` VALUES (5, '钱柳', '男', 18, '既往体健，否认高血压病、糖尿病、冠心病等慢性疾病，否认肝炎、结核、伤寒、疟疾等传染疾病，否认重大外伤史，输血史及手术史，否认食物与药物过敏史。预防接种史不详');
INSERT INTO `stud` VALUES (6, '孙立', '男', 17, '曾因不洁饮食引起过急性肠胃炎');
INSERT INTO `stud` VALUES (7, '周舞', '女', 21, '既往体健，否认高血压病、糖尿病、冠心病等慢性疾病，否认肝炎、结核、伤寒、疟疾等传染疾病，否认重大外伤史，输血史及手术史，否认食物与药物过敏史。预防接种史不详');
INSERT INTO `stud` VALUES (8, '郑珅', '女', 22, '一年前摔伤后，左肩关节骨折，在医院保守治疗，遗留左肩关节运动受限');
INSERT INTO `stud` VALUES (9, '许惠', '女', 22, '既往体健，否认高血压病、糖尿病、冠心病等慢性疾病，否认肝炎、结核、伤寒、疟疾等传染疾病，否认重大外伤史，输血史及手术史，否认食物与药物过敏史。预防接种史不详');
INSERT INTO `stud` VALUES (10, '田志慧', '女', 19, '患有慢性支气管炎病史，应用抗感染药物治疗有效');
INSERT INTO `stud` VALUES (11, '杨珊珊', '女', 19, '既往体健，否认高血压病、糖尿病、冠心病等慢性疾病，否认肝炎、结核、伤寒、疟疾等传染疾病，否认重大外伤史，输血史及手术史，否认食物与药物过敏史。预防接种史不详');
INSERT INTO `stud` VALUES (12, '刘羽寒', '女', 20, '二零一九年以脊椎病进入医院就诊');
INSERT INTO `stud` VALUES (13, '顾言语', '男', 19, '既往体健，否认高血压病、糖尿病、冠心病等慢性疾病，否认肝炎、结核、伤寒、疟疾等传染疾病，否认重大外伤史，输血史及手术史，否认食物与药物过敏史。预防接种史不详');
INSERT INTO `stud` VALUES (14, '张大白', '男', 18, '既往体健，否认高血压病、糖尿病、冠心病等慢性疾病，否认肝炎、结核、伤寒、疟疾等传染疾病，否认重大外伤史，输血史及手术史，否认食物与药物过敏史。预防接种史不详');
INSERT INTO `stud` VALUES (15, '陆轩', '女', 19, '既往体健，否认高血压病、糖尿病、冠心病等慢性疾病，否认肝炎、结核、伤寒、疟疾等传染疾病，否认重大外伤史，输血史及手术史，否认食物与药物过敏史。预防接种史不详');
INSERT INTO `stud` VALUES (16, '薛杉', '男', 17, '一年以来，患有不寐，以失眠为主症，表现为持续的、严重的睡眠困难');
INSERT INTO `stud` VALUES (17, '章太渊', '男', 20, '既往体健，否认高血压病、糖尿病、冠心病等慢性疾病，否认肝炎、结核、伤寒、疟疾等传染疾病，否认重大外伤史，输血史及手术史，否认食物与药物过敏史。预防接种史不详');
INSERT INTO `stud` VALUES (18, '杨渊博', '女', 18, '既往体健，否认高血压病、糖尿病、冠心病等慢性疾病，否认肝炎、结核、伤寒、疟疾等传染疾病，否认重大外伤史，输血史及手术史，否认食物与药物过敏史。预防接种史不详');
INSERT INTO `stud` VALUES (19, '张军', '女', 17, '既往体健，否认高血压病、糖尿病、冠心病等慢性疾病，否认肝炎、结核、伤寒、疟疾等传染疾病，否认重大外伤史，输血史及手术史，否认食物与药物过敏史。预防接种史不详');
INSERT INTO `stud` VALUES (20, '宋天正', '男', 20, '既往体健，否认高血压病、糖尿病、冠心病等慢性疾病，否认肝炎、结核、伤寒、疟疾等传染疾病，否认重大外伤史，输血史及手术史，否认食物与药物过敏史。预防接种史不详');
INSERT INTO `stud` VALUES (21, '姬凌', '女', 20, '既往体健，否认高血压病、糖尿病、冠心病等慢性疾病，否认肝炎、结核、伤寒、疟疾等传染疾病，否认重大外伤史，输血史及手术史，否认食物与药物过敏史。预防接种史不详');
INSERT INTO `stud` VALUES (22, '燕青', '男', 21, '18岁，患有急性上呼吸道感染，已在医院接受治疗');
INSERT INTO `stud` VALUES (23, '杜倩', '女', 22, '既往体健，否认高血压病、糖尿病、冠心病等慢性疾病，否认肝炎、结核、伤寒、疟疾等传染疾病，否认重大外伤史，输血史及手术史，否认食物与药物过敏史。预防接种史不详');
INSERT INTO `stud` VALUES (24, '董立', '女', 18, '既往体健，否认高血压病、糖尿病、冠心病等慢性疾病，否认肝炎、结核、伤寒、疟疾等传染疾病，否认重大外伤史，输血史及手术史，否认食物与药物过敏史。预防接种史不详');
INSERT INTO `stud` VALUES (25, '王飞云', '男', 19, '既往体健，否认高血压病、糖尿病、冠心病等慢性疾病，否认肝炎、结核、伤寒、疟疾等传染疾病，否认重大外伤史，输血史及手术史，否认食物与药物过敏史。预防接种史不详');
INSERT INTO `stud` VALUES (26, '丁冬芹', '男', 17, '既往体健，否认高血压病、糖尿病、冠心病等慢性疾病，否认肝炎、结核、伤寒、疟疾等传染疾病，否认重大外伤史，输血史及手术史，否认食物与药物过敏史。预防接种史不详');
INSERT INTO `stud` VALUES (27, '马祥', '女', 22, '既往体健，否认高血压病、糖尿病、冠心病等慢性疾病，否认肝炎、结核、伤寒、疟疾等传染疾病，否认重大外伤史，输血史及手术史，否认食物与药物过敏史。预防接种史不详');
INSERT INTO `stud` VALUES (28, '石诚', '男', 21, '两年前，患有急性化脓性扁桃体炎，已接受治疗');
INSERT INTO `stud` VALUES (29, '郭占云', '男', 21, '既往体健，否认高血压病、糖尿病、冠心病等慢性疾病，否认肝炎、结核、伤寒、疟疾等传染疾病，否认重大外伤史，输血史及手术史，否认食物与药物过敏史。预防接种史不详');
INSERT INTO `stud` VALUES (30, '刘瑶清', '女', 20, '既往体健，否认高血压病、糖尿病、冠心病等慢性疾病，否认肝炎、结核、伤寒、疟疾等传染疾病，否认重大外伤史，输血史及手术史，否认食物与药物过敏史。预防接种史不详');
INSERT INTO `stud` VALUES (31, '杜元晓', '女', 20, '既往体健，否认高血压病、糖尿病、冠心病等慢性疾病，否认肝炎、结核、伤寒、疟疾等传染疾病，否认重大外伤史，输血史及手术史，否认食物与药物过敏史。预防接种史不详');
INSERT INTO `stud` VALUES (32, '高建明', '男', 18, '既往体健，否认高血压病、糖尿病、冠心病等慢性疾病，否认肝炎、结核、伤寒、疟疾等传染疾病，否认重大外伤史，输血史及手术史，否认食物与药物过敏史。预防接种史不详');

SET FOREIGN_KEY_CHECKS = 1;
